Repository: Softcatala/translation-memory-tools
Catalog: latest-memories/tmx/fedora-tm.tmx
Source language: en
Languages: ca_es

source: The name of the NSS library to use in proxy domains. The NSS functions searched for in the library are in the form of _nss_$(libName)_$(function), for example _nss_files_getpwent.
ca_es: El nom de la biblioteca NSS per utilitzar en els servidors intermediaris de domini. Les funcions NSS buscades a la biblioteca tenen el format _nss_$(libName)_$(function), per exemple _nss_files_getpwent.

source: Options valid for proxy domains. <placeholder type="variablelist" id="0"/>
ca_es: Opcions vàlides per a servidors intermediaris de domini. <placeholder type="variablelist" id="0"/>

source: The local domain section
ca_es: La secció de domini local

source: This section contains settings for domain that stores users and groups in SSSD native database, that is, a domain that uses <replaceable>id_provider=local</replaceable>.
ca_es: Aquesta secció conté paràmetres per a dominis que emmagatzemen els usuaris i grups a la base de dades SSSD nadiu de, és a dir, un domini que utilitza <replaceable>id_provider = local</replaceable>.

source: default_shell (string)
ca_es: default_shell (cadena)

source: The default shell for users created with SSSD userspace tools.
ca_es: L'intèrpret d'ordres per defecte per als usuaris creats amb eines SSSD d'espai d'usuari.

source: Default: <filename>/bin/bash</filename>
ca_es: Per defecte: <filename>/bin/bash</filename>

source: base_directory (string)
ca_es: base_directory (cadena)

source: The tools append the login name to <replaceable>base_directory</replaceable> and use that as the home directory.
ca_es: Les eines afegeixen el nom d'usuari a <replaceable>base_directory</replaceable> i utilitzen això com el directori d'usuari.

source: Default: <filename>/home</filename>
ca_es: Per defecte: <filename>/home</filename>

source: create_homedir (bool)
ca_es: create_homedir (booleà)

source: Default: TRUE
ca_es: Per defecte: TRUE

source: remove_homedir (bool)
ca_es: remove_homedir (booleà)

source: homedir_umask (integer)
ca_es: homedir_umask (enter)

source: Used by <citerefentry> <refentrytitle>sss_useradd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> to specify the default permissions on a newly created home directory.
ca_es: Utilitzat per <citerefentry><refentrytitle>sss_useradd</refentrytitle> <manvolnum>8</manvolnum></citerefentry> per especificar els permisos per defecte en un directori personal acabat de crear.

source: Default: 077
ca_es: Per defecte: 077

source: skel_dir (string)
ca_es: skel_dir (cadena)

source: The skeleton directory, which contains files and directories to be copied in the user's home directory, when the home directory is created by <citerefentry> <refentrytitle>sss_useradd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>
ca_es: El directori d'esquelet que conté fitxers i directoris per copiar al directori de personal, quan el directori personal és creat per <citerefentry><refentrytitle>sss_useradd</refentrytitle> <manvolnum>8</manvolnum></citerefentry>

source: Default: <filename>/etc/skel</filename>
ca_es: Per defecte: <filename>/etc/skel</filename>

source: mail_dir (string)
ca_es: mail_dir (cadena)

source: The mail spool directory. This is needed to manipulate the mailbox when its corresponding user account is modified or deleted. If not specified, a default value is used.
ca_es: El directori de cua de correu. Això és necessari per manipular la bústia de correu quan el compte d'usuari corresponent és modificat o suprimit. Si no s'especifica, s'utilitzarà un valor per defecte.

source: Default: <filename>/var/mail</filename>
ca_es: Per defecte: <filename>/var/correu</filename>

source: userdel_cmd (string)
ca_es: userdel_cmd (cadena)

source: The command that is run after a user is removed. The command us passed the username of the user being removed as the first and only parameter. The return code of the command is not taken into account.
ca_es: L'ordre que s'executa després d'eliminar un usuari. L'ordre passa el nom d'usuari com el primer i únic paràmetre. El codi de retorn de l'ordre no es té en compte.

source: Default: None, no command is run
ca_es: Per defecte: Cap, no s'executa cap comanda

source: The following example shows a typical SSSD config. It does not describe configuration of the domains themselves - refer to documentation on configuring domains for more details. <placeholder type="programlisting" id="0"/>
ca_es: El següent exemple mostra una configuració típica d'SSSD. No descriu la configuració dels mateixos dominis - referiu-vos a la documentació de configuració de dominis per a més detalls. <placeholder type="programlisting" id="0"/>

source: This manual page describes the configuration of LDAP domains for <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>. Refer to the <quote>FILE FORMAT</quote> section of the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page for detailed syntax information.
ca_es: Aquesta pàgina del manual descriu la configuració de dominis LDAP per a <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>. Consulteu la secció <quote>FORMAT DE FITXER</quote> de la pàgina del manual <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> per obtenir informació detallada de la sintaxi.

source: You can configure SSSD to use more than one LDAP domain.
ca_es: Podeu configurar SSSD per utilitzar més d'un domini d'LDAP.

source: LDAP back end supports id, auth, access and chpass providers. If you want to authenticate against an LDAP server either TLS/SSL or LDAPS is required. <command>sssd</command> <emphasis>does not</emphasis> support authentication over an unencrypted channel. If the LDAP server is used only as an identity provider, an encrypted channel is not needed. Please refer to <quote>ldap_access_filter</quote> config option for more information about using LDAP as an access provider.
ca_es: El rerefons LDAP suporta proveïdors d'identificació, autenticació, accés i canvi de contrasenya. Si voleu autenticar contra un servidor LDAP s'exigeix TLS/SSL o LDAPS. L'<command>sssd</command> <emphasis>no</emphasis> suporta autenticació sobre un canal sense xifrar. Si el servidor de LDAP s'utilitza només com a un proveïdor d'identitats, no és necessari un canal xifrat. Si us plau refereiu-vos a l'opció <quote>ldap_access_filter</quote> per a més informació sobre l'ús d'LDAP com un proveïdor d'accés.

source: CONFIGURATION OPTIONS
ca_es: OPCIONS DE CONFIGURACIÓ

source: To enable service discovery ldap_chpass_dns_service_name must be set.
ca_es: Per habilitar el servei descobriment s'ha d'establir ldap_chpass_dns_service_name.

source: Default: empty, i.e. ldap_uri is used.
ca_es: Per defecte: buit, és a dir, s'utilitza ldap_uri.

source: ldap_search_base (string)
ca_es: ldap_search_base (cadena)

source: The default base DN to use for performing LDAP user operations.
ca_es: El DN base per defecte a utilitzar per realitzar operacions d'usuari d'LDAP.

source: ldap_schema (string)
ca_es: ldap_schema (cadena)

source: Default: rfc2307
ca_es: Per defecte: rfc2307

source: ldap_default_bind_dn (string)
ca_es: ldap_default_bind_dn (cadena)

source: The default bind DN to use for performing LDAP operations.
ca_es: El vincle DN per defecte per utilitzar en realitzar les operacions d'LDAP.

source: ldap_default_authtok_type (string)
ca_es: ldap_default_authtok_type (cadena)

source: The type of the authentication token of the default bind DN.
ca_es: El tipus de testimoni d'autenticació del vincle DN per defecte.

source: The two mechanisms currently supported are:
ca_es: Els dos mecanismes suportats actualment són:

source: ldap_default_authtok (string)
ca_es: ldap_default_authtok (cadena)

source: The authentication token of the default bind DN. Only clear text passwords are currently supported.
ca_es: El testimoni de l'autenticació de l'omissió s'uneixen DN. Només aclarir text contrasenyes estan suportats actualment.

source: ldap_user_object_class (string)
ca_es: ldap_user_object_class (cadena)

source: The object class of a user entry in LDAP.
ca_es: La classe d'objecte d'una entrada d'usuari a LDAP.

source: Default: posixAccount
ca_es: Per defecte: posixAccount

source: ldap_user_name (string)
ca_es: ldap_user_name (cadena)

source: The LDAP attribute that corresponds to the user's login name.
ca_es: L'atribut LDAP que correspon al nom de compte de l'usuari.

source: Default: uid
ca_es: Per defecte: uid

source: ldap_user_uid_number (string)
ca_es: ldap_user_uid_number (cadena)

source: The LDAP attribute that corresponds to the user's id.
ca_es: L'atribut LDAP que correspon al númerdo de l'identificador de l'usuari.

source: Default: uidNumber
ca_es: Per defecte: uidNumber

source: ldap_user_gid_number (string)
ca_es: ldap_user_gid_number (cadena)

source: The LDAP attribute that corresponds to the user's primary group id.
ca_es: L'atribut LDAP que correspon a l'identificador del grup primari de l'usuari.

source: Default: gidNumber
ca_es: Per defecte: gidNumber

source: ldap_user_gecos (string)
ca_es: ldap_user_gecos (cadena)

source: The LDAP attribute that corresponds to the user's gecos field.
ca_es: L'atribut LDAP que correspon al camp gecos de l'usuari.

source: Default: gecos
ca_es: Per defecte: gecos

source: ldap_user_home_directory (string)
ca_es: ldap_user_home_directory (cadena)

source: The LDAP attribute that contains the name of the user's home directory.
ca_es: L'atribut LDAP que conté el nom del directori personal de l'usuari.

source: Default: homeDirectory
ca_es: Per defecte: homeDirectory

source: ldap_user_shell (string)
ca_es: ldap_user_shell (cadena)

source: The LDAP attribute that contains the path to the user's default shell.
ca_es: L'atribut LDAP que conté la ruta a l'intèrpret d'ordres per defecte de l'usuari.

source: Default: loginShell
ca_es: Per defecte: loginShell

source: ldap_user_uuid (string)
ca_es: ldap_user_uuid (cadena)

source: The LDAP attribute that contains the UUID/GUID of an LDAP user object.
ca_es: L'atribut LDAP que conté el UUID/GUID d'un objecte d'usuari d'LDAP.

source: Default: nsUniqueId
ca_es: Per defecte: nsUniqueId

source: ldap_user_modify_timestamp (string)
ca_es: ldap_user_modify_timestamp (cadena)

source: The LDAP attribute that contains timestamp of the last modification of the parent object.
ca_es: L'atribut LDAP que conté la data i hora de l'última modificació de l'objecte pare.

source: Default: modifyTimestamp
ca_es: Per defecte: modifyTimestamp

source: ldap_user_shadow_last_change (string)
ca_es: ldap_user_shadow_last_change (cadena)

source: When using ldap_pwd_policy=shadow, this parameter contains the name of an LDAP attribute corresponding to its <citerefentry> <refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> counterpart (date of the last password change).
ca_es: En utilitzar ldap_pwd_policy=shadow, aquest paràmetre conté el nom d'un atribut d'LDAP corresponent al seu homòleg <citerefentry><refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum></citerefentry> (data de l'últim canvi de contrasenya).

source: Default: shadowLastChange
ca_es: Per defecte: shadowLastChange

source: ldap_user_shadow_min (string)
ca_es: ldap_user_shadow_min (cadena)

source: When using ldap_pwd_policy=shadow, this parameter contains the name of an LDAP attribute corresponding to its <citerefentry> <refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> counterpart (minimum password age).
ca_es: En utilitzar ldap_pwd_policy=shadow, aquest paràmetre conté el nom d'un atribut d'LDAP corresponent al seu homòleg <citerefentry><refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum></citerefentry> (edat mínima de la contrasenya).

source: Default: shadowMin
ca_es: Per defecte: shadowMin

source: ldap_user_shadow_max (string)
ca_es: ldap_user_shadow_max (cadena)

source: When using ldap_pwd_policy=shadow, this parameter contains the name of an LDAP attribute corresponding to its <citerefentry> <refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> counterpart (maximum password age).
ca_es: En utilitzar ldap_pwd_policy=shadow, aquest paràmetre conté el nom d'un atribut d'LDAP corresponent al seu homòleg <citerefentry><refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum></citerefentry> (edat màxima de la contrasenya).

source: Default: shadowMax
ca_es: Per defecte: shadowMax

source: ldap_user_shadow_warning (string)
ca_es: ldap_user_shadow_warning (cadena)

source: When using ldap_pwd_policy=shadow, this parameter contains the name of an LDAP attribute corresponding to its <citerefentry> <refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> counterpart (password warning period).
ca_es: En utilitzar ldap_pwd_policy=shadow, aquest paràmetre conté el nom d'un atribut d'LDAP corresponent al seu homòleg <citerefentry><refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum></citerefentry> (període d'advertència de contrasenya).

source: Default: shadowWarning
ca_es: Per defecte: shadowWarning

source: ldap_user_shadow_inactive (string)
ca_es: ldap_user_shadow_inactive (cadena)

source: When using ldap_pwd_policy=shadow, this parameter contains the name of an LDAP attribute corresponding to its <citerefentry> <refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> counterpart (password inactivity period).
ca_es: En utilitzar ldap_pwd_policy=shadow, aquest paràmetre conté el nom d'un atribut d'LDAP corresponent al seu homòleg <citerefentry><refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum></citerefentry> (període d'inactivitat de contrasenya).

source: Default: shadowInactive
ca_es: Per defecte: shadowInactive

source: ldap_user_shadow_expire (string)
ca_es: ldap_user_shadow_expire (cadena)

source: When using ldap_pwd_policy=shadow or ldap_account_expire_policy=shadow, this parameter contains the name of an LDAP attribute corresponding to its <citerefentry> <refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> counterpart (account expiration date).
ca_es: En utilitzar ldap_pwd_policy=shadow o ldap_account_expire_policy=shadow, aquest paràmetre conté el nom d'un atribut d'LDAP corresponent al seu homòleg <citerefentry><refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum></citerefentry> (data de caducitat del compte).

source: Default: shadowExpire
ca_es: Per defecte: shadowExpire

source: ldap_user_krb_last_pwd_change (string)
ca_es: ldap_user_krb_last_pwd_change (cadena)

source: When using ldap_pwd_policy=mit_kerberos, this parameter contains the name of an LDAP attribute storing the date and time of last password change in kerberos.
ca_es: En utilitzar ldap_pwd_policy=mit_kerberos, aquest paràmetre conté el nom d'un atribut d'LDAP que emmagatzema la data i hora del darrer canvi de contrasenya en kerberos.

source: Default: krbLastPwdChange
ca_es: Per defecte: krbLastPwdChange

source: ldap_user_krb_password_expiration (string)
ca_es: ldap_user_krb_password_expiration (cadena)

source: When using ldap_pwd_policy=mit_kerberos, this parameter contains the name of an LDAP attribute storing the date and time when current password expires.
ca_es: En utilitzar ldap_pwd_policy=mit_kerberos, aquest paràmetre conté el nom d'un atribut d'LDAP que emmagatzema la data i hora d'expiració de la contrasenya actual.

source: Default: krbPasswordExpiration
ca_es: Per defecte: krbPasswordExpiration

source: ldap_user_principal (string)
ca_es: ldap_user_principal (cadena)

source: The LDAP attribute that contains the user's Kerberos User Principal Name (UPN).
ca_es: L'atribut LDAP que conté el Nom Principal d'Usuari (UPN) de l'usuari de Kerberos.

source: Default: krbPrincipalName
ca_es: Per defecte: krbPrincipalName

source: ldap_force_upper_case_realm (boolean)
ca_es: ldap_force_upper_case_realm (booleà)

source: Some directory servers, for example Active Directory, might deliver the realm part of the UPN in lower case, which might cause the authentication to fail. Set this option to a non-zero value if you want to use an upper-case realm.
ca_es: Alguns servidors de directori, per exemple Active Directory, podria entregar la part de l'àmbit de l'UPN en minúscules, que podria provocar que l'autenticació fallàs. Definiu aquesta opció a un valor diferent de zero si voleu utilitzar un àmbit en majúscules.

source: ldap_enumeration_refresh_timeout (integer)
ca_es: ldap_enumeration_refresh_timeout (enter)

source: Determine how often to check the cache for inactive entries (such as groups with no members and users who have never logged in) and remove them to save space.
ca_es: Determina la freqüència en comprovar la memòria cau per a entrades inactives (grups sense membres i usuaris que mai no han iniciat una sessió) i eliminar-los per estalviar espai.

source: Setting this option to zero will disable the cache cleanup operation.
ca_es: A zero, aquesta opció desactivarà l'operació de neteja de memòria cau.

source: Default: 10800 (12 hours)
ca_es: Per defecte: 10800 (12 hores)

source: ldap_user_fullname (string)
ca_es: ldap_user_fullname (cadena)

source: The LDAP attribute that corresponds to the user's full name.
ca_es: L'atribut LDAP que correspon al nom complet de l'usuari.

source: Default: cn
ca_es: Per defecte: cn

source: ldap_user_member_of (string)
ca_es: ldap_user_member_of (cadena)

source: The LDAP attribute that lists the user's group memberships.
ca_es: L'atribut LDAP que llista la pertanença a grups de l'usuari.

source: Default: memberOf
ca_es: Per defecte: memberOf

source: ldap_user_authorized_service (string)
ca_es: ldap_user_authorized_service (cadena)

source: If access_provider=ldap and ldap_access_order=authorized_service, SSSD will use the presence of the authorizedService attribute in the user's LDAP entry to determine access privilege.
ca_es: Si access_provider=ldap i ldap_access_order=authorized_service, l'SSSD farà servir la presència de l'atribut authorizedService a l'entrada LDAP de l'usuari per determinar els privilegis d'accés.

source: An explicit deny (!svc) is resolved first. Second, SSSD searches for explicit allow (svc) and finally for allow_all (*).
ca_es: Una denegació explícita (! svc) es resol en primer lloc. En segon lloc, l'SSSD cerca autoritzacions explícites (svc) i, finalment, allow_all (*).

source: Default: authorizedService
ca_es: Per defecte: authorizedService

source: ldap_group_object_class (string)
ca_es: ldap_group_object_class (cadena)

source: The object class of a group entry in LDAP.
ca_es: La classe d'objecte d'una entrada de grup a LDAP.

source: Default: posixGroup
ca_es: Per defecte: posixGroup

source: ldap_group_name (string)
ca_es: ldap_group_name (cadena)

source: The LDAP attribute that corresponds to the group name.
ca_es: L'atribut LDAP que es correspon amb el nom del grup.

source: ldap_group_gid_number (string)
ca_es: ldap_group_gid_number (cadena)

source: The LDAP attribute that corresponds to the group's id.
ca_es: L'atribut LDAP que correspon a l'identificador del grup.

source: ldap_group_member (string)
ca_es: ldap_group_member (cadena)

source: The LDAP attribute that contains the names of the group's members.
ca_es: L'atribut LDAP que conté els noms dels membres del grup.

source: Default: memberuid (rfc2307) / member (rfc2307bis)
ca_es: Per defecte: memberuid (rfc2307) / member (rfc2307bis)

source: ldap_group_uuid (string)
ca_es: ldap_group_uuid (cadena)

source: The LDAP attribute that contains the UUID/GUID of an LDAP group object.
ca_es: L'atribut LDAP que conté el UUID/GUID d'objecte de grup LDAP.

source: ldap_group_modify_timestamp (string)
ca_es: ldap_group_modify_timestamp (cadena)

source: ldap_group_nesting_level (integer)
ca_es: ldap_group_nesting_level (enter)

source: If ldap_schema is set to a schema format that supports nested groups (e.g. RFC2307bis), then this option controls how many levels of nesting SSSD will follow. This option has no effect on the RFC2307 schema.
ca_es: Si ldap_schema s'estableix a un format d'esquema que suporta grups niats (p. ex. RFC2307bis), llavors aquest opció controla quants nivells de nidificació seguirà l'SSSD. Aquesta opció no té cap efecte sobre l'esquema RFC2307.

source: Default: 2
ca_es: Per defecte: 2

source: ldap_netgroup_object_class (string)
ca_es: ldap_netgroup_object_class (cadena)

source: The object class of a netgroup entry in LDAP.
ca_es: La classe d'objecte d'una entrada de netgroup a LDAP.

source: Default: nisNetgroup
ca_es: Per defecte: nisNetgroup

source: ldap_netgroup_name (string)
ca_es: ldap_netgroup_name (cadena)

source: The LDAP attribute that corresponds to the netgroup name.
ca_es: L'atribut LDAP que es correspon amb el nom del netgroup.

source: ldap_netgroup_member (string)
ca_es: ldap_netgroup_member (cadena)

source: The LDAP attribute that contains the names of the netgroup's members.
ca_es: L'atribut LDAP que conté els noms dels membres del netgroup.

source: Default: memberNisNetgroup
ca_es: Per defecte: memberNisNetgroup

source: ldap_netgroup_triple (string)
ca_es: ldap_netgroup_triple (cadena)

source: The LDAP attribute that contains the (host, user, domain) netgroup triples.
ca_es: L'atribut LDAP que conté les tripletes netgroup (maquina, usuari, domini).

source: Default: nisNetgroupTriple
ca_es: Per defecte: nisNetgroupTriple

source: ldap_netgroup_uuid (string)
ca_es: ldap_netgroup_uuid (cadena)

source: The LDAP attribute that contains the UUID/GUID of an LDAP netgroup object.
ca_es: L'atribut LDAP que conté el UUID/GUID d'un objecte de netgroup d'LDAP.

source: ldap_netgroup_modify_timestamp (string)
ca_es: ldap_netgroup_modify_timestamp (cadena)

source: ldap_search_timeout (integer)
ca_es: ldap_search_timeout (enter)

source: ldap_network_timeout (integer)
ca_es: ldap_network_timeout (enter)

source: Specifies the timeout (in seconds) after which the <citerefentry> <refentrytitle>poll</refentrytitle> <manvolnum>2</manvolnum> </citerefentry>/<citerefentry> <refentrytitle>select</refentrytitle> <manvolnum>2</manvolnum> </citerefentry> following a <citerefentry> <refentrytitle>connect</refentrytitle> <manvolnum>2</manvolnum> </citerefentry> returns in case of no activity.
ca_es: Especifica el temps d'espera (en segons) després que el <citerefentry><refentrytitle>sondeig</refentrytitle> <manvolnum>2</manvolnum></citerefentry>/<citerefentry><refentrytitle>selecció</refentrytitle> <manvolnum>2</manvolnum></citerefentry> seguit d'una <citerefentry><refentrytitle>connexió</refentrytitle> <manvolnum>2</manvolnum></citerefentry> retorna en cas de cap activitat.

source: ldap_opt_timeout (integer)
ca_es: ldap_opt_timeout (enter)

source: Specifies a timeout (in seconds) after which calls to synchronous LDAP APIs will abort if no response is received. Also controls the timeout when communicating with the KDC in case of SASL bind.
ca_es: Especifica un temps d'espera (en segons) després que les trucades a les API síncrones de LDAP s'abandonaran si no es rep cap resposta. També controla el temps d'espera en comunicar amb el KDC en cas d'un vincle SASL.

source: ldap_tls_reqcert (string)
ca_es: ldap_tls_reqcert (cadena)

source: Specifies what checks to perform on server certificates in a TLS session, if any. It can be specified as one of the following values:
ca_es: Especifica quines comprovacions s'han de realitzar sobre els certificats de servidor en una sessió TLS, si s'escau. Es pot especificar com un dels valors següents:

source: <emphasis>never</emphasis> = The client will not request or check any server certificate.
ca_es: <emphasis>never</emphasis> = El client no demanarà o comprovarà cap certificat del servidor.
